; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=132, out_folder=htg/blocksworld/training, instance_id=4, seed=2028, goal_proportion=0.03

(define (problem blocksworld-04)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 - object)
 (:init 
    (arm-empty)
    (clear b37)
    (on-table b37)
    (clear b103)
    (on-table b103)
    (clear b132)
    (on b132 b9)
    (on b9 b86)
    (on b86 b22)
    (on-table b22)
    (clear b52)
    (on-table b52)
    (clear b112)
    (on b112 b55)
    (on b55 b59)
    (on b59 b100)
    (on b100 b128)
    (on-table b128)
    (clear b11)
    (on-table b11)
    (clear b51)
    (on b51 b6)
    (on b6 b89)
    (on b89 b77)
    (on-table b77)
    (clear b78)
    (on b78 b20)
    (on b20 b88)
    (on b88 b109)
    (on b109 b107)
    (on b107 b121)
    (on b121 b57)
    (on-table b57)
    (clear b16)
    (on-table b16)
    (clear b98)
    (on b98 b95)
    (on b95 b33)
    (on-table b33)
    (clear b92)
    (on b92 b81)
    (on-table b81)
    (clear b106)
    (on b106 b7)
    (on-table b7)
    (clear b19)
    (on b19 b15)
    (on b15 b5)
    (on-table b5)
    (clear b4)
    (on b4 b108)
    (on b108 b58)
    (on b58 b110)
    (on b110 b64)
    (on-table b64)
    (clear b28)
    (on b28 b27)
    (on b27 b97)
    (on b97 b127)
    (on b127 b18)
    (on-table b18)
    (clear b35)
    (on b35 b10)
    (on b10 b69)
    (on b69 b43)
    (on b43 b50)
    (on-table b50)
    (clear b66)
    (on b66 b83)
    (on b83 b42)
    (on-table b42)
    (clear b102)
    (on b102 b56)
    (on b56 b74)
    (on b74 b14)
    (on b14 b84)
    (on b84 b41)
    (on b41 b32)
    (on-table b32)
    (clear b90)
    (on b90 b70)
    (on-table b70)
    (clear b47)
    (on b47 b111)
    (on-table b111)
    (clear b13)
    (on-table b13)
    (clear b129)
    (on b129 b114)
    (on b114 b94)
    (on b94 b24)
    (on b24 b63)
    (on b63 b118)
    (on b118 b29)
    (on b29 b101)
    (on-table b101)
    (clear b76)
    (on-table b76)
    (clear b117)
    (on b117 b62)
    (on b62 b3)
    (on b3 b36)
    (on b36 b31)
    (on b31 b48)
    (on-table b48)
    (clear b23)
    (on b23 b72)
    (on b72 b122)
    (on b122 b115)
    (on b115 b45)
    (on b45 b99)
    (on b99 b82)
    (on-table b82)
    (clear b44)
    (on b44 b49)
    (on b49 b53)
    (on b53 b125)
    (on b125 b104)
    (on-table b104)
    (clear b12)
    (on-table b12)
    (clear b60)
    (on b60 b120)
    (on b120 b87)
    (on b87 b65)
    (on-table b65)
    (clear b54)
    (on b54 b30)
    (on b30 b126)
    (on-table b126)
    (clear b38)
    (on-table b38)
    (clear b17)
    (on b17 b75)
    (on b75 b61)
    (on b61 b39)
    (on-table b39)
    (clear b116)
    (on b116 b123)
    (on b123 b26)
    (on b26 b113)
    (on b113 b105)
    (on b105 b130)
    (on b130 b71)
    (on b71 b119)
    (on b119 b67)
    (on b67 b73)
    (on-table b73)
    (clear b1)
    (on b1 b68)
    (on-table b68)
    (clear b131)
    (on b131 b79)
    (on b79 b80)
    (on b80 b40)
    (on-table b40)
    (clear b25)
    (on b25 b2)
    (on b2 b85)
    (on-table b85)
    (clear b21)
    (on-table b21)
    (clear b124)
    (on b124 b34)
    (on b34 b93)
    (on b93 b96)
    (on b96 b8)
    (on-table b8)
    (clear b46)
    (on-table b46)
    (clear b91)
    (on-table b91))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b1)
    (on-table b1))))

; plan
1. (unstack b1 b68)
   deleted: (on b1 b68) (clear b1) (arm-empty)
   added: (holding b1) (clear b68)
   goals met: 0 of 4
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 4
3. (unstack b117 b62)
   deleted: (on b117 b62) (clear b117) (arm-empty)
   added: (holding b117) (clear b62)
   goals met: 1 of 4
4. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 1 of 4
5. (unstack b25 b2)
   deleted: (on b25 b2) (clear b25) (arm-empty)
   added: (holding b25) (clear b2)
   goals met: 2 of 4
6. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 4
7. (unstack b62 b3)
   deleted: (on b62 b3) (clear b62) (arm-empty)
   added: (holding b62) (clear b3)
   goals met: 2 of 4
8. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 2 of 4
9. (unstack b3 b36)
   deleted: (on b3 b36) (clear b3) (arm-empty)
   added: (holding b3) (clear b36)
   goals met: 2 of 4
10. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 3 of 4
11. (unstack b2 b85)
   deleted: (on b2 b85) (clear b2) (arm-empty)
   added: (holding b2) (clear b85)
   goals met: 2 of 4
12. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 4 of 4
